#### Terraform Format and Style 🖌`success`
#### Terraform Initialization 🐣`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.iam.module.iam_github_oidc_provider.data.tls_certificate.this[0]: Reading...
module.iam.module.iam_github_oidc_provider.data.tls_certificate.this[0]: Read complete after 0s [id=7eb5508708a4b70fa4fcc76a72d83ee71bfe84ff]
module.iam.module.iam_github_oidc_role.data.aws_partition.current: Reading...
module.iam.module.iam_github_oidc_provider.data.aws_partition.current: Reading...
module.iam.module.iam_github_oidc_role.data.aws_caller_identity.current: Reading...
module.iam.module.iam_github_oidc_role.data.aws_partition.current: Read complete after 0s [id=aws]
module.iam.module.iam_github_oidc_provider.data.aws_partition.current: Read complete after 0s [id=aws]
module.iam.module.iam_github_oidc_role.data.aws_caller_identity.current: Read complete after 1s [id=359113079523]
module.iam.module.iam_github_oidc_role.data.aws_iam_policy_document.this[0]: Reading...
module.iam.module.iam_github_oidc_role.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2750687502]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.iam.module.iam_github_oidc_provider.aws_iam_openid_connect_provider.this[0] will be created
  + resource "aws_iam_openid_connect_provider" "this" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = (known after apply)
      + thumbprint_list = [
          + "1c58a3a8518e8759bf075b76b750d4f2df264fcd",
          + "f879abce0008e4eb126e0097e46620f5aaae26ad",
          + "6938fd4d98bab03faadb97b34396831e3780aea1",
        ]
      + url             = "https://token.actions.githubusercontent.com"
    }

  # module.iam.module.iam_github_oidc_role.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:TagSession",
                          + "sts:AssumeRoleWithWebIdentity",
                        ]
                      + Condition = {
                          + "ForAllValues:StringEquals" = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                              + "token.actions.githubusercontent.com:iss" = "http://token.actions.githubusercontent.com"
                            }
                          + StringLike                  = {
                              + "token.actions.githubusercontent.com:sub" = "repo:fbatta/terraform-aws-iot:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::359113079523:oidc-provider/token.actions.githubusercontent.com"
                        }
                      + Sid       = "GithubOidcAuth"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "GitHubActionsRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.iam.module.iam_github_oidc_role.aws_iam_role_policy_attachment.this["IAMOIDCFullAccess"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::359113079523:policy/IAMOIDCFullAccess"
      + role       = "GitHubActionsRole"
    }

  # module.iam.module.iam_github_oidc_role.aws_iam_role_policy_attachment.this["IoTFullAccess"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSIoTFullAccess"
      + role       = "GitHubActionsRole"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>

*Pusher: @fbatta, Action: `pull_request`, Workflow: `Pull request`*